# Merging the DataFrames

In [14]:
import pandas as pd

In [15]:
df1 = pd.DataFrame({'employee_name_1':['Hank','Tom','Robin'], 'score':[100,32,78]})
df1

  employee_name_1  score
0            Hank    100
1             Tom     32
2           Robin     78

In [16]:
df2 = pd.DataFrame({'employee_name_2':['Hank','Sherry','Amber'], 'score':[100,56,12]})
df2

  employee_name_2  score
0            Hank    100
1          Sherry     56
2           Amber     12

# We will be joining these two data frames using common attributes.
# In the example above 'score' is the common attribute.

In [17]:
df1.merge(df2, how= 'inner')  # similar to sql inner join

  employee_name_1  score employee_name_2
0            Hank    100            Hank

In [18]:
df1.merge(df2,how = 'left') # similar to sql left join

  employee_name_1  score employee_name_2
0            Hank    100            Hank
1             Tom     32             NaN
2           Robin     78             NaN

In [19]:
df1.merge(df2,how = 'right') # similar to sql right join

  employee_name_1  score employee_name_2
0            Hank    100            Hank
1             NaN     56          Sherry
2             NaN     12           Amber

In [20]:
df1.merge(df2,how='outer') # or values of left join and right join

  employee_name_1  score employee_name_2
0            Hank    100            Hank
1             Tom     32             NaN
2           Robin     78             NaN
3             NaN     56          Sherry
4             NaN     12           Amber